{"id":24602,"date":"2019-11-03T06:35:20","date_gmt":"2019-11-03T06:35:20","guid":{"rendered":"https:\/\/colorlib.com\/wp\/?p=24602"},"modified":"2019-11-04T06:51:20","modified_gmt":"2019-11-04T06:51:20","slug":"how-to-make-a-website","status":"publish","type":"post","link":"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/","title":{"rendered":"How to Make a WordPress Website &#8211; Step-by-Step Guide for Beginners"},"content":{"rendered":"<p><strong>Trying to figure out how to create a website? Today you will find out!<\/strong><\/p>\n<p><strong>An easy step-by-step website setup guide written by web developers who have created hundreds of websites and helped thousands of others to create their own website. <\/strong><\/p>\n<div class=\"vcex-module vcex-divider vcex-divider-solid wpex-max-w-100 wpex-mx-auto wpex-block wpex-h-0 wpex-border-b wpex-border-solid wpex-border-gray-200\" style=\"margin-top:20px;margin-bottom:20px;\"><\/div>\n<h2>6 reasons why you’ll love this awesome website setup guide:<\/h2>\n<div class=\"intro-section\">\n<div class=\"vc_row wpb_row\">\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-book\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n\t\t\t\t<span class=\"builder-title\">Beginner-Friendly<\/span><\/p>\n<p>This guide is very detailed, comprehensive and easy to follow even if you&#8217;re not tech-savvy. <\/p>\n<\/p><\/div><\/div>\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-refresh\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n\t\t\t\t<span class=\"builder-title\">Up-to-Date<\/span><\/p>\n<p>This guide is updated weekly to keep up with the latest web design trends.<\/p>\n<\/p><\/div><\/div><\/div>\n<div class=\"vc_row wpb_row\">\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-rocket\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n\t\t\t\t<span class=\"builder-title\">Fast Setup<\/span><\/p>\n<p>Within an hour your website will be up and running and is going to be responsive and mobile-friendly.<\/p>\n<\/p><\/div><\/div>\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-wordpress\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n<p>\t\t\t\t<span class=\"builder-title\">Platform-Specific<\/span><\/p>\n<p>Your website will be based on the right platform and in the right way.<\/p>\n<\/p><\/div><\/div><\/div>\n<div class=\"vc_row wpb_row\">\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-check\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n\t\t\t\t<span class=\"builder-title\">Guaranteed Results<\/span><\/p>\n<p>We guarantee that by the end of this guide you&#8217;ll have a working website<\/p>\n<\/p><\/div><\/div>\n<div class=\"vc_col-sm-6 intro-benefits\">\n<div class=\"vc_col-sm-3\">\n\t\t\t\t<i class=\"ticon ticon-life-ring\"><\/i>\n\t\t\t<\/div>\n<div class=\"vc_col-sm-9\">\n<p>\t\t\t\t<span class=\"builder-title\">Free Support<\/span><\/p>\n<p>We are open for questions. Drop a comment below with your question and we will be happy to help<\/p>\n<\/p><\/div><\/div><\/div>\n<\/div>\n<div class=\"vcex-module vcex-divider vcex-divider-solid wpex-max-w-100 wpex-mx-auto wpex-block wpex-h-0 wpex-border-b wpex-border-solid wpex-border-gray-200\" style=\"margin-top:20px;margin-bottom:20px;\"><\/div>\n<p>At Colorlib we spend a great deal of time reviewing products and providing good reading content for our readership. Many of whom are familiar with the workings for a website running on WordPress. This guide is intended to help anyone who is creating their first website, likely with WordPress. It&#8217;s the platform we recommend and use for our website. <\/p>\n<p>A step by step tutorial &#8211; we start off with finding the right content management system, choosing a domain name, then the right web hosting service, adding the right themes, plugins and customizing your site&#8217;s appearance. By the time you are done with this how to make a WordPress website for beginners guide you&#8217;ll have a full fledged website ready to go!<\/p>\n<h2>This guide contains three simple and easy-to-follow steps:<\/h2>\n<div class=\"vc_row wpb_row builder-steps-row\">\n<div class=\"vc_col-sm-4 step-block\">\n<div class=\"builder-top-icon\">\n\t\t\t\t<i class=\"ticon ticon-heartbeat\"><\/i>\n\t\t\t<\/div>\n<div class=\"builder-steps\">\n\t\t\t\t<span class=\"builder-title\">STEP 1<\/span><\/p>\n<p><strong>Choose the right platform for your website<\/strong><\/p>\n<\/p><\/div><\/div>\n<div class=\"vc_col-sm-4 step-block\">\n<div class=\"builder-top-icon\">\n\t\t\t\t<i class=\"ticon ticon-globe\"><\/i>\n\t\t\t<\/div>\n<div class=\"builder-steps\">\n<p>\t\t\t\t<span class=\"builder-title\">STEP 2<\/span><\/p>\n<p><strong>Choose the right website name (domain) and hosting<\/strong><\/p>\n<\/p><\/div><\/div>\n<div class=\"vc_col-sm-4 step-block\">\n<div class=\"builder-top-icon\">\n\t\t\t\t<i class=\"ticon ticon-cogs\"><\/i>\n\t\t\t<\/div>\n<div class=\"builder-steps\">\n<p>\t\t\t\t<span class=\"builder-title\">STEP 3<\/span><\/p>\n<p><strong>Configure your newly created WordPress website<\/strong><\/p>\n<\/p><\/div><\/div><\/div>\n<div class=\"web-steps\"><i class=\"ticon ticon-heartbeat\"><\/i><\/p>\n<h1>Step 1<\/h1>\n<h3>Choose the right platform for your website<\/h3>\n<\/div>\n<h2>What is a Content Management System?<\/h2>\n<p>A content management system (CMS) in simple terms, is a platform of sorts or a mechanism which permits you to create your content and publish it on a website. Let&#8217;s say that it is a coat hanger stand with the coat being your content.<\/p>\n<p>It is software that is installed on your host&#8217;s server. Your host provider will likely have a one click installation process to help you get your CMS installed. Once it is installed, you can log in to your site as the admin and add photos, text and other content. You can use the content you&#8217;ve added to create blog posts and other forms of content like a product page or display a work portfolio on your website.<\/p>\n<p>A CMS is way more than just a means to an end, you can install a theme which is a modified template to suit the specific niche and purpose of your site. With the template added, you can customize the appearance of your site. You can add plugins to add function to your site, for example a social sharing plugin to help spread the word about your site via social networks.<\/p>\n<p>All of this and more can be accomplished with a Content Management System.<\/p>\n<h3>Which CMS is best for you?<\/h3>\n<p>An overwhelming majority of websites  use WordPress. The other two options that lag way behind in comparison to WordPress (certainly in popularity) are Joomla and Drupal.<\/p>\n<h4>WordPress<\/h4>\n<p>The ideal option for someone who&#8217;s creating his or her first website. It has considerable scalability and works well with low and medium traffic websites. We receive 1.5 million views every month and we run WordPress, so that gives you an idea of what medium traffic constitutes if you were wondering. Even large websites such as TIME Magazine, CNN, TED, Techcrunch, NBC and others <a href=\"https:\/\/colorlib.com\/wp\/most-popular-websites-powered-by-wordpress\/\">use WordPress to server millions of pageviews each day<\/a>. <\/p>\n<p><strong>WordPress has a great number of points that can be made in favor of its use.<\/strong><\/p>\n<ul>\n<li>Easy To Install: Most hosting services have one click installation options for WordPress given the number of people who use it.<\/li>\n<li>Strong Community &amp; Open Source: It is free and used by a lot of people. There are a plethora of free themes and plugins that you can leverage for your site. Apart from the freebies, premium themes and plugins are cheap and come with excellent support services from their providers. If you ever have a doubt or a problem a simple Google search can answer your query. If fact, I&#8217;ll go so far as to say you&#8217;ll find the answer to your doubts answered by the first three results of a Google search. A strong community will aid in your WordPress initiation process should you ever encounter any hiccups. And you can always drop your comments here either Aigars or me will be sure to respond to the at the earliest opportunity.<\/li>\n<li>Ideal For Non tech savvy online entrepreneurs: Most of the products associated with WordPress, such as themes and plugins are fairly straightforward and intuitive to use. Installing a Content Management System like WordPress is only the first step of the process, there is much more to website creation beyond that. Like WordPress which is easy to install and configure, the tools that you&#8217;ll require to make your website whole are easy to handle.<\/li>\n<\/ul>\n<p><strong>Two not so quite favorable things about WordPress<\/strong><\/p>\n<ul>\n<li>One drawback of WordPress, it may become unwieldy if your site grows far too large and receives an enormous amount of daily traffic. The cost of your hosting goes up. But we are talking about traffic in the order of millions here and it isn&#8217;t something you should let bother you for now.<\/li>\n<li>Another potential problem is the quality of free plugins and themes. While most are good and have fairly high security standards, you&#8217;d should be wary of unknown third party plugins. WordPress is a secure platform out the box, but adding third party software while exercising poor judgement is a bad idea. That being said security vulnerabilities are generally fixed as soon as they are detected.<\/li>\n<\/ul>\n<div class=\"vc_col-sm-8 colorlib-infogram\">\n<script id=\"infogram_0_cms_usage_2015-14\" src=\"\/\/e.infogr.am\/js\/embed.js?xl6\" type=\"text\/javascript\"><\/script>\n<\/div>\n<p>As you can see WordPress is by far the most popular content management system and is used by 65% CMS powered websites worldwide. <\/p>\n<p>The thing you need to know is all CMSs have one drawback or the other. And for a new web admin, WordPress is the best way to go! But I&#8217;ll talk about Drupal and Joomla, all the same. You should certainly be aware of them, should you decide to switch your CMS at a later point in time. And it will also tell you why perhaps Joomla and Drupal are not best suited to the needs of beginner.<\/p>\n<h4>Drupal<\/h4>\n<p>Unlike WordPress, Drupal is not too well suited for the technically inept or a first time website developer. Drupal is an open source CMS and is largely utilized by big corporations with vast websites and high traffic loads. It has its own customization possibilities with themes and plugins created to add value to Drupal sites. Drupal websites are a bit faster and little less taxing on the host&#8217;s server resources.<\/p>\n<p>But if you&#8217;re new to web development, it isn&#8217;t for you. Why? It is more complicated than it needs to be to meet your requirements. It is designed for complex, vast websites with high traffic loads, which your new website will not be to begin with. Given that, there is no need to add to the difficulty of the website creation process unnecessarily.  And besides, you can always switch to Drupal at a later date.<\/p>\n<h4>Joomla<\/h4>\n<p>Open source and free like the previous two platforms. It is a tad better than the other two when it comes to creating a community of users (like a small social network or tight knit community for your readers) and is far more amenable to creating social websites with a lot of interaction and engagement from users. It is easier to handle than Drupal and offers more than WordPress in terms of performance and tweakability.<\/p>\n<p>And again my reasons are the same for not recommending it for you, unnecessary complication that you do not need.<\/p>\n<h3>WordPress &#8211; Probably the best option for you!<\/h3>\n<p>If you are starting off with a new domain name with no traffic so to speak of, you are better off with WordPress. It is exceedingly easy to use, it is free and comes with an enormous number of premium quality free themes and plugins. The cost of hosting is low and many hosts provide for easy one click installation of WordPress. And since a growing percentage of online entrepreneurs do not know how to program in HTML, CSS and PHP, WordPress is the best choice as it offers excellent customizability even to WordPress newbies.<\/p>\n[vc_row][vc_column width=&#8221;1\/1&#8243;][vc_toggle title=&#8221;Click here to summarize, why WordPress is the best choice, if you still harbour any lingering doubts. (Optional)&#8221; open=&#8221;false&#8221;]\n<ul>\n<li>Free &#8211; Who isn&#8217;t happy about this?<\/li>\n<li>Strong Community &#8211; Someone to answer your questions, if it isn&#8217;t answered on the hundreds of niche WordPress sites to begin with.<\/li>\n<li>Frequently Updated Platform &#8211; Updates are important (Fix bugs, security, constantly improving features and performance and ensure compatibility with all WordPress products)<\/li>\n<li>A host of themes and plugins that are free &#8211; Keep costs low.<\/li>\n<li>Excellent options for premium plugins and themes &#8211; That little extra at a reasonable price.<\/li>\n<li>Easy to use and beginner friendly &#8211; Designed for you and non programmers.<\/li>\n<li>Secure platform out of box &#8211; Important for revenue generating websites<\/li>\n<li>Scalable for medium traffic &#8211; For when you grow fast and need to accommodate more traffic.<\/li>\n<li>Multiple options for hosting including managed hosting services (Managed hosting &#8211; You focus on content, your host takes care of everything else)<\/li>\n<li>Wealth of choices for running site backups &#8211; Site Backups are a big deal and extremely important for medium traffic sites, it ensures minimal downtime if your site should ever be hacked.<\/li>\n<\/ul>\n<p><em>Do not get confused with WordPress.com, which is a blog site built with WordPress. What you are building here is a yoursitename.com as opposed to yoursitename.WordPress.com. And if you do not know the differences between the two, please read &lt;this post that elaborates differences between two.&gt;<\/em><\/p>\n[\/vc_toggle][\/vc_column][\/vc_row]\n<p>Now that you have chosen the best platform for your website you can proceed with the next step.<\/p>\n<div class=\"vcex-module vcex-divider vcex-divider-solid wpex-max-w-100 wpex-mx-auto wpex-block wpex-h-0 wpex-border-b wpex-border-solid wpex-border-gray-200\" style=\"margin-top:20px;margin-bottom:20px;\"><\/div>\n<div class=\"web-steps\"><i class=\"ticon ticon-globe\"><\/i><\/p>\n<h1>Step 2<\/h1>\n<h3>Choose the right website name (domain) and hosting<\/h3>\n<\/div>\n<p>Before you choose a domain name, you&#8217;ll need be sure of the niche you&#8217;d like to concentrate on. Selecting a niche area to focus on, is an important task in and of itself. To create a revenue generating website it is critical that you research the target keyword pool and the niche it is derived from. For the time being, just make sure it is something you like and are genuinely passionate about. And ensure that you have reasonable expertise in the subject matter involved.<\/p>\n<p>You can literally register any available (not registered yet) domain name but here is something I recommend:<\/p>\n<ul>\n<li><strong>Business website &#8211;<\/strong> If you are making a website for your business it would be best to choose a domain name that is your company name or brand. An example domain name would be <strong>YourComapanyName.com<\/strong> or <strong>YourBrandName.com<\/strong><\/li>\n<li><strong>Personal website<\/strong> &#8211; If it is going to be your personal website it would be great to go with <strong>com<\/strong><\/li>\n<li><strong>Hobby website <\/strong>&#8211; The sky&#8217;s the limit 🙂<\/li>\n<\/ul>\n<p>Most popular domain names extensions (the end part of website address, like .com) are .com, .org, .net, but in recent years a huge amount of new domain extensions <a href=\"https:\/\/en.wikipedia.org\/wiki\/List_of_Internet_top-level_domains\" target=\"_blank\" rel=\"noopener noreferrer\">have been introduced<\/a> (Wikipedia). Now you can register crazy domain names such as <strong>YourCompanyName.pizza,<\/strong> <strong>YourCompanyName.green, <\/strong>or<strong> YourName.ninja.<\/strong><\/p>\n<p>However, for your first website I recommend to stick with .com, .net and .org. New domain extensions haven’t gone mainstream yet and might confuse your visitors. Even some social networks, services and apps have problems displaying these new domain names that’s why I advice to avoid them, at least for now.<\/p>\n<h2>Choosing The Right Domain Name<\/h2>\n<p>The next step in our process involves choosing a domain name. A domain name is basically the URL one types into a browser&#8217;s address bar to visit a particular website.<\/p>\n<p>Getting the right domain name is crucial. A few things you need to keep in mind while considering domain name choices.<\/p>\n<ul>\n<li><strong>Short<\/strong> &#8211; Shorter names work better when it comes to remembrance and are easy to type as well.<\/li>\n<li><strong>Brandable<\/strong> &#8211; Remember your domain also runs to your brand, make sure it isn&#8217;t memorable for all the wrong reasons.<\/li>\n<li><strong>Memorable<\/strong> &#8211; People forget easily, come up with a name that first time visitors to your site are likely to remember.<\/li>\n<li><strong>Catchy <\/strong>&#8211; You want a domain name that rolls off the tongue and describes what you do.<\/li>\n<li><strong>Easy to type.<\/strong><\/li>\n<li><strong>Includes keyword<\/strong> (optional) &#8211; Identify the right keywords or combination of keywords. The closer your domain name is to your site&#8217;s niche, the better for search engine optimization (SEO)<\/li>\n<li><strong>Niche specific<\/strong> (optional) &#8211; If you are writing a website about a specific niche check if there are popular abbreviations that you can use. For example, in WordPress there are many highly ranked websites with &#8220;wp&#8221; as part of their name. <a href=\"https:\/\/colorlib.com\/out\/wpengine\" target=\"_blank\" rel=\"noopener noreferrer\">WPEngine.com<\/a>, a managed hosting service for WordPress.<\/li>\n<\/ul>\n<h3>Funny domain name mistakes<\/h3>\n<p>Here are some domain names someone have registered without realizing what a huge mistake they have made:<\/p>\n<ul>\n<li>Speedofart.com &#8211; Speed of Art<\/li>\n<li>Choosespain.com &#8211; Choose Spain<\/li>\n<li>Gotahoe.com &#8211; Go Tahoe<\/li>\n<\/ul>\n[vc_row][vc_column width=&#8221;1\/1&#8243;][vc_toggle title=&#8221;Click here to read advanced tips about domains (Optional)&#8221; open=&#8221;false&#8221;]\n<p>1. Now to get yourself a domain, you need a domain registrar. A domain registrar is basically someone or an organisation that reserves your right to use a domain for a given period of time. Normally web hosting companies perform the function of a domain registrar in addition to being a web hosting service provider. So you do not have to be concerned with this specifically as your web hosting service will also play the role of domain registrar. <\/p>\n<p>This option is great if you have multiple domains and tend to switch your hosting provider regularly. Not that we would recommend it but it does happen. Also it is more secure to keep your hosting separated from domain registrar. In case your hosting accounts gets compromised hackers won&#8217;t get access to your domain. <\/p>\n<p>2. If you are exceedingly confident of your ability to generate revenue, you might consider buying a domain name that has been parked by someone else. For various reasons, sometimes the premium you end up paying for a domain name may be well worth the expense. You can buy domain names on Flippa.com or Godaddy.com but consider this wisely, we wouldn&#8217;t want you to pay a hefty price only to find out that the domain name isn&#8217;t worth it later.<\/p>\n[\/vc_toggle][\/vc_column][\/vc_row]\n<h2>Hosting<\/h2>\n<p>You really have two options when it comes to hosting provider types recommended for WordPress newbies.<\/p>\n<ul>\n<li>Shared Hosting<\/li>\n<li>Managed WordPress Hosting<\/li>\n<\/ul>\n<p>I do not recommend anything other than a shared hosting plan for first time webmasters. All other forms of hosting that you may have heard of like Virtual Private Hosting (requires reasonable technical know how), managed WordPress hosting (too costly) might not be the right choice for your first website. As your knowledge and business grows you might consider VPS or fully managed WordPress hosting but let&#8217;s <a href=\"https:\/\/colorlib.com\/wp\/how-to-choose-wordpress-hosting\/\" target=\"_blank\" rel=\"noopener noreferrer\">leave that for another post.<\/a> <\/p>\n<p>Shared hosting is the way to go and later we can talk about upgrading your host. We&#8217;ve recommended two shared hosting services and have also added elaborate installation processes for WordPress with both of them. Both hosting providers offers domain registration and website hosting and that&#8217;s exactly what we need to create an awesome website.   <\/p>\n<h3>BlueHost<\/h3>\n<p>To make WordPress installation process easier we have created a short video that will guide you through installation process. <strong>We might receive a commission if you decided to purchase through these links.<\/strong><\/p>\n<div class=\"wpex-responsive-media\"><iframe title=\"How to Make a Website – Step-by-Step Guide for Beginners\" width=\"980\" height=\"735\" src=\"https:\/\/www.youtube.com\/embed\/64hHo8kXNb0?feature=oembed\"  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/div>\n<p>Click here to <a href=\"https:\/\/colorlib.com\/out\/bluehost\" target=\"_blank\" rel=\"noopener noreferrer\">visit Bluehost<\/a> and proceed with your first website setup. <\/p>\n<p>If you had some problems understanding setup process outlined in video you can follow steps below. <\/p>\n<ol>\n<li>Choose <a href=\"https:\/\/colorlib.com\/out\/bluehost\" target=\"_blank\" rel=\"noopener noreferrer\">the right hosting page<\/a>. I&#8217;d suggest the starter package. It offers plenty of speed, performance, functionality and storage for your first website. You can upgrade your hosting plan as your website grows><\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/bluehost-pricing-options.png\" alt=\"bluehost pricing options\" width=\"1000\" height=\"902\" class=\"aligncenter size-full wp-image-25582\" \/><\/p>\n<li>You will be prompted to choose a domain name as you can see in example below. Double check your domain name to avoid typos.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/bluehost-domain-name-registration.png\" alt=\"bluehost - choose your website name\" width=\"1000\" height=\"501\" class=\"aligncenter size-full wp-image-25583\" \/><\/p>\n<li>And on the next screens, enter your personal information and credit card details. And complete payment.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/signup-to-bluehost-hosting.png\" alt=\"signup-to-bluehost-hosting\" width=\"1000\" height=\"655\" class=\"aligncenter size-full wp-image-25584\" \/><\/p>\n<li>In Bluehost cPanel (administration panel), find a button which says Install WordPress<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/bluehost-cpanel-demo1.jpg\" alt=\"bluehost-cpanel-demo\" width=\"1000\" height=\"762\" class=\"aligncenter size-full wp-image-25603\" \/><\/p>\n<li>Click on a green Install button to proceed with WordPress installation<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/one-click-bluehost-wordpress-instal1.jpg\" alt=\"one-click-bluehost-wordpress-instal\" width=\"1000\" height=\"595\" class=\"aligncenter size-full wp-image-25604\" \/><\/p>\n<li>Now select if you want to use your website with or without &#8220;www.&#8221; at front of your website name (www.YourWebsite.com or YourWebsite.com). If you can&#8217;t decide you can leave it as is. It can be easily changed afterwards.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/choose-www-domain-name.jpg\" alt=\"choose-www-domain-name\" width=\"1000\" height=\"595\" class=\"aligncenter size-full wp-image-25593\" \/><\/p>\n<li>The details for the WordPress installation like email ID, username and password can be set. And tick all the necessary conditions under a licence agreement.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/advanced-wordpress-bluehost-setup.jpg\" alt=\"advanced-wordpress-bluehost-setup\" width=\"1000\" height=\"785\" class=\"aligncenter size-full wp-image-25590\" \/><\/p>\n<li>And install.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-instalation-in-progress-small.jpg\" alt=\"WordPress installation in progress\" width=\"1000\" height=\"336\" class=\"aligncenter size-full wp-image-25596\" \/><\/p>\n<li>Once installation is complete you will see a clear message on top saying &#8220;Your Install is Complete!&#8221; and button saying &#8220;View Credentials&#8221;<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-login-info-bluehost.jpg\" alt=\"wordpress login info bluehost\" width=\"1000\" height=\"379\" class=\"aligncenter size-full wp-image-25599\" \/><\/p>\n<li>By clicking on that button you will be sent to a page where you will be able to find your newly installed WordPress login credentials. <\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-login-credentials.jpg\" alt=\"WordPress login credential reveal on Bluehost\" width=\"1000\" height=\"819\" class=\"aligncenter size-full wp-image-25598\" \/><\/p>\n<li>Now you can login on your website by clicking link that says YourWebsitName.com\/wp-admin.<\/li>\n<\/ol>\n<h3>SiteGround <\/h3>\n<p>SiteGroud&#8217;s shared hosting plan has a similar, equally easy to use WordPress installation and domain registration process. The site asks you whether you have a domain name or need to register one, in our case since you are creating your first site <a href=\"https:\/\/www.siteground.com\/web-hosting.htm\" target=\"_blank\" rel=\"noopener noreferrer\">you need to register a domain<\/a>.<\/p>\n<p>Following the domain registration you can follow this easy to use <a href=\"https:\/\/www.siteground.com\/tutorials\/wordpress\/wordpress-wizard-installation.htm\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">this three step tutorial<\/a> for a guided WordPress installation. It is best to select &#8220;Get WordPress Preinstalled in this account&#8221; and you will not need to get your hands dirty. You&#8217;ll need to set admin email ID, username and password, you&#8217;re set!<\/p>\n<h3>SiteGround vs BlueHost<\/h3>\n<p>Really anyone&#8217;s pick, I suggest that you have a look at both and decide based on which ever domain registration and WordPress installation process seems easier. But personally I feel it doesn&#8217;t matter much and you shouldn&#8217;t worry too much over which of the two hosting services to go with.<\/p>\n<p>If you&#8217;d like a far more elaborate list of shared hosting service providers, <a href=\"https:\/\/colorlib.com\/wp\/how-to-choose-wordpress-hosting\/\" target=\"_blank\" rel=\"noopener noreferrer\">check out our WordPress hosting guide<\/a>.<\/p>\n<p>Now that your domain is registered, hosting paid for and your WordPress installed. What&#8217;s next?<\/p>\n<div class=\"vcex-module vcex-divider vcex-divider-solid wpex-max-w-100 wpex-mx-auto wpex-block wpex-h-0 wpex-border-b wpex-border-solid wpex-border-gray-200\" style=\"margin-top:20px;margin-bottom:20px;\"><\/div>\n<div class=\"web-steps\"><i class=\"ticon ticon-cogs\"><\/i><\/p>\n<h1>Step 3<\/h1>\n<h3>Configure your newly created WordPress website<\/h3>\n<\/div>\n<h2>WordPress Admin Screens<\/h2>\n<ul>\n<li>Go to yourwebsitename.com\/wp-admin.<\/li>\n<li>Type in the username and password you previously entered during the WordPress installation process.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-login-screen.jpg\" alt=\"wordpress login screen\" width=\"1000\" height=\"735\" class=\"aligncenter size-full wp-image-25600\" \/><\/p>\n<p>Your WordPress admin menu is available on the left side of the screen. Allowing your cursor to linger over them will open sub menus.<\/p>\n<ul>\n<li>Dashboard<\/li>\n<li>Posts<\/li>\n<li>Media<\/li>\n<li>Links<\/li>\n<li>Pages<\/li>\n<li>Comments<\/li>\n<li>Appearance<\/li>\n<li>Plugins<\/li>\n<li>Users<\/li>\n<li>Tools<\/li>\n<li>Settings<\/li>\n<\/ul>\n<p>That is a lot of stuff which you deal with. But I&#8217;ve promised to get your site up and running. So for the purposes of this post I will not be talking about Settings, Tools, Users or Your Dashboard.<\/p>\n<p>I will talk about the rest of the menu options which are part of your WordPress menu. Let&#8217;s get started.<\/p>\n<h2>Customizing your site&#8217;s Appearance and activating a WordPress Theme<\/h2>\n<h3>Themes (Appearances &gt; Themes)<\/h3>\n<ol>\n<li>Open Appearances &gt; Themes. From here on have a look at the heading of each subsection if you have doubts with regards to accessing a particular part of the WordPress menu from the admin screen.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/install-new-wordpress-theme.jpg\" alt=\"install new wordpress theme\" width=\"1000\" height=\"712\" class=\"aligncenter size-full wp-image-25606\" \/><\/p>\n<li>And click on the &#8220;Add New&#8221; button on the top. And choose from one of the themes displayed or search for a specific theme. For a list of awesome free themes you should <a href=\"https:\/\/colorlib.com\/wp\/themes\">check this page<\/a>.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/install-sparkling-theme.jpg\" alt=\"install-sparkling-theme\" width=\"1000\" height=\"712\" class=\"aligncenter size-full wp-image-25607\" \/><\/p>\n<li>Install a new theme that you fancy and activate it.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-theme-instalation-process1.jpg\" alt=\"wordpress-theme-instalation-process\" width=\"1000\" height=\"529\" class=\"aligncenter size-full wp-image-25615\" \/><\/p>\n<li>The next part involves customization of a theme. You can access this under from Appearance &gt; Customize. You can do a number of things to your site&#8217;s appearance from here. But that&#8217;s not the crux of this post, a theme is sufficient to start a website.<\/li>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-theme-customizer.jpg\" alt=\"wordpress-theme-customizer\" width=\"1000\" height=\"671\" class=\"aligncenter size-full wp-image-25612\" \/><\/p>\n<\/ol>\n<h3>Widgets (Appearances &gt; Widgets)<\/h3>\n<p>Widgets are preset modules or pieces of code that add to a certain function which will prove useful for your website in some capacity or the other. Your sidebars, footers and headers can be loaded with widgets.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-widget-manager.jpg\" alt=\"wordpress-widget-manager\" width=\"1000\" height=\"671\" class=\"aligncenter size-full wp-image-25614\" \/><\/p>\n<p>As you can see in the above screenshot, there 6 widgets in the sidebar.  These widgets include a search bar, a recent posts widget, recent comments, archives, categories and meta. Then you can see 4 footer areas where you can add widgets just the same. The number of footer, header and sidebar areas available to you depends on the theme you are using.<\/p>\n<p>Widgets are not plugins, but they are small chunks of code that add a bit of function. Sometimes it may help with navigation, sometimes with social media, you can even use to add HTML to a text widget which will function as coded to do so. So widgets are a very useful tool but you need to learn a bit about them before you can use them to the fullest.<\/p>\n<h3>Menus (Appearances &gt; Menu)<\/h3>\n<p>Menus are an extremely important for any website. They offer a means to navigate your site and its content. After all, what&#8217;s the point in creating captivating content if your visitor can not find it easily on your site. Bad menus and navigation can lead to a high bounce rate (the number of visitors as a percentage who leave your site after just viewing just one page).<\/p>\n<p>You may have seen websites with menus on the top or the side and even at the bottom. We can do all of this.<\/p>\n<p>You&#8217;d like to include pages like &#8220;About&#8221;, &#8220;Blog&#8221;, &#8220;Contact&#8221; and &#8220;Our Services&#8221; as part of your primary menu. Any page you&#8217;d like displayed on your menu can be added. The number of menus and their placement on your site depends on your WordPress theme.<\/p>\n<p>You can add all the stuff that you see on the left to the menu ranging from pages to products as part of your menu. Again what you can include as part of the menu depends on your WordPress theme.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-menu-manager.jpg\" alt=\"wordpress-menu-manager\" width=\"1000\" height=\"671\" class=\"aligncenter size-full wp-image-25611\" \/><\/p>\n<p><strong>A good menu,<\/strong><\/p>\n<ul>\n<li>Is concise and minimal.<\/li>\n<li>It is a representation of all your site&#8217;s offerings.<\/li>\n<li>Very intuitive to use and maneuver around your site.<\/li>\n<\/ul>\n<p>Keep that in mind and you should be fine.<\/p>\n<h3>Background (Appearances &gt; Background)<\/h3>\n<p>Many website choose to have plain single color background and I am big fan of that.<\/p>\n<p>The Colorlib blog has a plain white background and it keeps things simple. But the homepage of the site is pretty awesome with a purple background and our tagline.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-background-color.jpg\" alt=\"wordpress-background-color\" width=\"1000\" height=\"694\" class=\"aligncenter size-full wp-image-25608\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Websites that are media heavy, examples would include photography sites or portfolio websites have great backgrounds. If you want your website to send across a powerful visual cue to your audience use a powerful background image. Else you can simply opt for a plain color which is appropriate for any blog that emphasizes readability.<\/p>\n<p>A background should not be confused with a slider image which is basically a constantly changing image that moves across or your screen or changes with fancy animation.<\/p>\n<h2>Adding New Plugins (Plugins &gt; Add New)<\/h2>\n<p>Plugins are a scripts or pieces of code written to perform a very specific function or set of functions on your website.<\/p>\n<p>A simple example would be social sharing plugin, it helps share your content across different social platforms and helps get the word out that your content is awesome. Similarly, people have developed plugins for search engine optimization, security purposes, creating and maintaining a portfolio of images, to create contact forms, for caching the list is endless.<\/p>\n<p>If you want to read a detailed list of plugins that we think is absolutely essential, read this <a href=\"https:\/\/colorlib.com\/wp\/essential-free-wordpress-plugins\/\" target=\"_blank\" rel=\"noopener noreferrer\">comprehensive list of essential plugins<\/a>.<\/p>\n<h2>Adding Pages (Pages &gt; Add New)<\/h2>\n<p>Pages on a website help divide your website into a requisite number of pieces to present the different sections of your site&#8217;s content. Pages are to themes like widgets are to plugins. With pages you can create specific template styles that can be called on command for different purposes that require the same or similar design. Pages are more than posts and are used for specific purposes on your site. You can create pages specifically to cater to the requirements of a Contact Us Page or perhaps create landing page.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/add-new-page-wordpress.jpg\" alt=\"add-new-page-wordpress\" width=\"1000\" height=\"641\" class=\"aligncenter size-full wp-image-25616\" \/><\/p>\n<p>And you are greeted by a New Page, which you can now fill up. From this new screen, you can create a new page and assign page attributes.<\/p>\n<p>If you either need to create a template that you&#8217;re likely to use often or need to recreate a section of your site for a specific purpose, creating a page is the way to go.<\/p>\n<h2>Comments (Access from WordPress menu)<\/h2>\n<p>Websites need readers to make them successful. Comments are a very powerful means to establish a great debate on your site and this only further adds value to your site. Hardly, one percent of the traffic that visits your site will ever comment. And that is assuming that the content is great to begin with. Driving interaction with passive readers on your site is difficult and takes time and effort.<\/p>\n<p>A great post with a pre-existing comment history helps your site receive more comments. Aigars wrote an awesome post on Colorlib a while back, yet till this day it still keeps receiving comments and continues to be a great source of traffic.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/WordPress-comments-preview.jpg\" alt=\"WordPress-comments-preview\" width=\"1000\" height=\"641\" class=\"aligncenter size-full wp-image-25610\" \/><\/p>\n<p>And remember, WordPress allows you to link your site when you comment on another person&#8217;s blog. And this may send visitors your way, if you play your cards right and make genuine attempts to offer something constructive. For this same reason, many people will leave their comments on your blog as well.<\/p>\n<p>If I feel your content is great and a particular post that you&#8217;ve written is awesome, then I&#8217;ll almost jump at the chance to leave my comment first and best anyone else to first comment. Because I know eventually it will lead a few visitors back to my site.<\/p>\n<p>Comments are a great way to build an awesome readership and a loyal following for your site.<\/p>\n<h2>Adding Content<\/h2>\n<p>Content is king may be a cliched line. But it is true now more so than ever before. There are many more websites now than there ever were before. You name a niche, any niche and it is bound to be saturated to the hilt with websites producing content about said niche. WordPress is a very profitable niche. Why? 50% of websites use it and many of them are new to WP. WordPress newbies and even intermediate level users require a few resources to help them get started up and make changes to their WordPress sites, not too dissimilar to the content on Colorlib 😉 But a website like <a href=\"https:\/\/colorlib.com\/wp\/how-blogs-and-websites-make-money-online\/\">Colorlib works well and generates revenue<\/a> only when we offer value to our readers.<\/p>\n<p>We publish a great number of articles on premium WordPress themes and should you choose to buy one of them after clicking on our links we receive a small commission on your purchase. But truth be told, our most popular and widely read articles aren&#8217;t the ones that describe premium WordPress themes or plugins, rather they are WordPress tutorials and posts dedicated to free themes, plugins and other WordPress related articles. Because it is only when we offer value to readers that our site grows.<\/p>\n<p>So based on your site&#8217;s niche and your expertise,  you need to produce content that genuinely offers value to would be readers. If you intend to create your site purely for monetary purposes, it will not be successful in the long run. No wait a minute, it may still be profitable but certainly not as successful as it could have been had you tried to genuinely help your audiences. So focus on good content.<\/p>\n<p>Pick your niche and offer great value to your readers. And watch your traffic grow steadily and if you are lucky, perhaps even go through the roof!<\/p>\n<p>So how do you publish your content on WordPress? What are the formats available to you apart from just plain ol&#8217; text?<\/p>\n<h3>Posts (Posts &gt; Add New)<\/h3>\n<p>The beating heart of your site or most sites anyway. At the end of this tutorial when all&#8217;s said and done, you&#8217;ll be here to populate your site with posts. WordPress has a very easy to use posting mechanism and this one of the reasons, it is so popular.<\/p>\n<p>You have two ways in which you can write your posts: one is the visual editor and the other is HTML editor. You can opt to use the visual editor to begin with, but you should know the HTML editor (referred to as text editor) is a very powerful tool to help you create the right formatting for your posts. The sooner you are comfortable with the text editor, the better of you will be. You may notice I am using the visual editor and truth be told, once I&#8217;ve added all the necessary formatting I prefer the visual editor.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/add-blog-post-to-wordpress.jpg\" alt=\"add-blog-post-to-wordpress\" width=\"1000\" height=\"681\" class=\"aligncenter size-full wp-image-25605\" \/><\/p>\n<p>The visual editor is very much similar to most text editors and permits you to add bold \/ italic effects to your text, change its font, add bulleted lists and numbered lists, align content differently and add hyperlinks. There is also a distraction free writing mode which gives you a fullscreen version of the editor.<\/p>\n<h3>Categories (Posts &gt; Categories)<\/h3>\n<p>Categories are a means to divide your content. Categories are important when your site publishes content on a number of issues. You can add categories from your Post editor or you can access it under Posts &gt; Categories.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/wordpress-categories1.jpg\" alt=\"wordpress-categories\" width=\"1000\" height=\"681\" class=\"aligncenter size-full wp-image-25609\" \/><\/p>\n<p>Now you can name the category to create one and then you can add a slug which is basically a URL add on of sorts for all your site&#8217;s posts on that specific category. For example, if I know that Colorlib produces a lot of theme collection content, I can Google search &#8220;Colorlib + any keyword\/category&#8221; and the first search result link is &#8211; https:\/\/colorlib.com\/wp\/category\/collections\/ . With this I can view only the posts that have been published under the category, &#8220;Collections&#8221;.<\/p>\n<p>So it is a very effective way to divide your site&#8217;s content and make finding stuff on your site much easier for a visitor.<\/p>\n<h3>Tags (Posts &gt; Tags)<\/h3>\n<p>Tags are very similar to categories, except each post generally has its own set of tags. Tags are a tad more specific than categories but that apart they are the same and they aid in helping visitors find your content more easily.<\/p>\n<h3>Media (Media &gt;Add New)<\/h3>\n<p>Media as in photos and videos are important to normal websites. They are even more so for media heavy websites. Adding media is easy with WordPress. You can either add media from Posts or you can add media directly to the media library.<\/p>\n<p>You can add the image title, a caption, description to the image. But it is also important you also add the alt text which helps search engines identify your image. It is a small step in ensuring good search engine optimization.<\/p>\n<p>There a lot of effects and stuff you can do to your imagery like make it pop up or use a lightbox with WordPress plugins. But that&#8217;s for another day.<\/p>\n<h2>Your Profile<\/h2>\n<p>Setting up your WordPress profile. This is rather easy to deal with. You can edit your profile from the &#8220;Edit Your Profile&#8221; on your WordPress admin screen on the top right hand corner. You can describe yourself and add the necessary social media links as well.<\/p>\n<p>And to add a profile picture for your WordPress ID, <a href=\"https:\/\/en.gravatar.com\/site\/login\" target=\"_blank\" rel=\"noopener noreferrer\">you&#8217;ll need to get a Gravatar account<\/a>. You&#8217;ll need an account from WordPress.com with which you can login to your site&#8217;s admin panel.<\/p>\n<h1>Just Start!<\/h1>\n<p>We have far too many inhibitions, starting stuff is one of them. It opens the door to failure.<\/p>\n<p>Creating the website and generating revenue is no joke. It is hard work, sometimes seemingly unrewarding work.<\/p>\n<p>Over the next few weeks and months, we&#8217;ll be launching our &#8220;Getting Started With WordPress&#8221; post series to help you out.<\/p>\n<p>And apart from that if you need anything else, do let us know in the comments below! Aigars and I will always be happy to help you out 🙂<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trying to figure out how to create a website? Today you will find out! An easy step-by-step website setup guide written by web developers who have created hundreds of websites and helped thousands of others to create their own website.&hellip;<\/p>\n","protected":false},"author":3082,"featured_media":25618,"comment_status":"open","ping_status":"open","sticky":true,"template":"","format":"standard","meta":[],"categories":[10],"tags":[2193,58,2077,2190,2191,2074,2192],"post_series":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v15.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Make a WordPress Website - Step-by-Step Guide for Beginners<\/title>\n<meta name=\"description\" content=\"A step-by-step guide for anyone tech savvy or not to get a website up and running in under an hour. Start your WordPress website\/blog\/magazine today with our help!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Make a WordPress Website - Step-by-Step Guide for Beginners\" \/>\n<meta property=\"og:description\" content=\"A step-by-step guide for anyone tech savvy or not to get a website up and running in under an hour. Start your WordPress website\/blog\/magazine today with our help!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\" \/>\n<meta property=\"og:site_name\" content=\"Colorlib\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/colorlib\" \/>\n<meta property=\"article:published_time\" content=\"2019-11-03T06:35:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-04T06:51:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/how-to-setup-website.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"620\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@colorlib\" \/>\n<meta name=\"twitter:site\" content=\"@colorlib\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"22 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/colorlib.com\/wp\/#website\",\"url\":\"https:\/\/colorlib.com\/wp\/\",\"name\":\"Colorlib\",\"description\":\"Probably The Best WordPress Themes\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/colorlib.com\/wp\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/sites\/2\/how-to-setup-website.jpg\",\"width\":1100,\"height\":620,\"caption\":\"how-to-setup-website\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/#webpage\",\"url\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\",\"name\":\"How to Make a WordPress Website - Step-by-Step Guide for Beginners\",\"isPartOf\":{\"@id\":\"https:\/\/colorlib.com\/wp\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/#primaryimage\"},\"datePublished\":\"2019-11-03T06:35:20+00:00\",\"dateModified\":\"2019-11-04T06:51:20+00:00\",\"author\":{\"@id\":\"https:\/\/colorlib.com\/wp\/#\/schema\/person\/8e1e83425efa92f7a6dd65a98f40fc91\"},\"description\":\"A step-by-step guide for anyone tech savvy or not to get a website up and running in under an hour. Start your WordPress website\/blog\/magazine today with our help!\",\"breadcrumb\":{\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/colorlib.com\/wp\/\",\"url\":\"https:\/\/colorlib.com\/wp\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/colorlib.com\/wp\/category\/tutorial\/\",\"url\":\"https:\/\/colorlib.com\/wp\/category\/tutorial\/\",\"name\":\"Tutorial\"}},{\"@type\":\"ListItem\",\"position\":3,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\",\"url\":\"https:\/\/colorlib.com\/wp\/how-to-make-a-website\/\",\"name\":\"How to Make a WordPress Website &#8211; Step-by-Step Guide for Beginners\"}}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/colorlib.com\/wp\/#\/schema\/person\/8e1e83425efa92f7a6dd65a98f40fc91\",\"name\":\"Aigars Silkalns\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/colorlib.com\/wp\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/colorlib.com\/wp\/wp-content\/uploads\/avatar\/3atu.jpg\",\"caption\":\"Aigars Silkalns\"},\"description\":\"Frontend web developer and web designer specialized in free and premium WordPress theme development. Started to learn to code 2 years ago and now I am familiar with CSS\/HTML\/JavaScript (jQuery) and PHP. Obsessed with application performance, user experience and simplicity.\",\"sameAs\":[\"https:\/\/colorlib.com\/\",\"https:\/\/twitter.com\/colorlib\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","amp_validity":null,"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/posts\/24602"}],"collection":[{"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/users\/3082"}],"replies":[{"embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/comments?post=24602"}],"version-history":[{"count":65,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/posts\/24602\/revisions"}],"predecessor-version":[{"id":248998,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/posts\/24602\/revisions\/248998"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/media\/25618"}],"wp:attachment":[{"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/media?parent=24602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/categories?post=24602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/tags?post=24602"},{"taxonomy":"post_series","embeddable":true,"href":"https:\/\/colorlib.com\/wp\/wp-json\/wp\/v2\/post_series?post=24602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}